Revit 2027 API
FailuresAccessor.GetFailureMessages Method
 Provides access to the individual failure messages currently posted in the document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<FailureMessageAccessor> GetFailureMessages()
Public Function GetFailureMessages As IList(Of FailureMessageAccessor)
public:
IList<FailureMessageAccessor^>^ GetFailureMessages()
member GetFailureMessages : unit -> IList<FailureMessageAccessor>
Return Value
IList<FailureMessageAccessor>
 The accessors to the individual failure messages posted in the document.
Exceptions
Exception | Condition
InvalidOperationException |  This FailuresAccessor is inactive (is used outside of failures processing).
Remarks
 Returned set of messages will be ordered from more severe to less severe.
See Also
Reference
FailuresAccessor Class
GetFailureMessages Overload
Autodesk.Revit.DB Namespace